// 전개연산자 ( ... )
// 배열과 객체의 값을 원본은 유지하면서
// 새로운 복제본을 만들때
// 일부를 추가, 변경(update)하고자 할때
// 코드를 간소하게 사용할 수 있도록 하는 연산자

let 배열 = [1,2,3];

// 구상하기는 "배열"에 담긴 값을 새배열에 복제하고 "새배열"에 10을 추가하여
// 새로운 배열을 생성하고 싶었다
// 여기까지는 잘 된것 같은데
// 문제는 원본 배열이 변형 되었다
let 새배열 = 배열;
새배열.push(10);
console.table(새배열)

let 새배열4 = [];
배열.forEach( (요소) => {
    새배열4.push(요소)
})
새배열4.push(40);
console.table(새배열4)

// 전개연산자 사용하기
// 원본인 "배열"의 모든 요소를 펼쳐 놓고
// 거기에 새로운 값인 20을 추가하고 값들만 새배열2에 복제하고
// 원본 배열은 손상 시키지 안혹 새로운 요소가 추가된 배열을 다시 만들 수 있다.
let 새배열2 = [ ...배열, 20];
console.table(새배열2)

let 새배열3 = [ ...배열, 30]
console.table(새배열3)

// 원본인 "객체"를 변형하기 않고 원본의 내용을 모두 포함하면서
// 새로운 요소인 주소가 추가된 "객체복제" 객체를 만드는 방법
let 객체 = { name:"hello", tel:"1111"}
let 객체복제 = { ...객체, addr:"home"}

let 숫자배열 = [10,20,30,40,50]

// 변수 "one", "two", "three", "four", "five" 순서대로 선언하고
// 숫자배열에 담긴 요소들을 순서대로 한개씩 선언된 변수에 담아서 초기화 하라
let [one, two, three, four, five] = 숫자배열;

let one1 = 10;
let two1 = 20;
let three1 = 30;

console.log(one, two, five)

// 배열의 요소를 만들고
let country = ["Korea", "USA", "China", "Japan", "English"]
// 배열의 요소를 초기값을 갖는 변수 생성하기
let [K, U, C, J, E] = country

console.log(K, U, C, J, E)